code cleanup after code review
